In [3]:
import pandas as pd
import numpy as ny

In [5]:
dict1 = {
    "numbers": [2,5,6,7,9,0],
    "values":[324,2335,432,45,32,54]
}

In [6]:
df = pd.DataFrame(dict1)

In [8]:
df

   numbers  values
0        2     324
1        5    2335
2        6     432
3        7      45
4        9      32
5        0      54

In [10]:
df.iloc[0,1]

324

In [11]:
df.drop(0)

   numbers  values
1        5    2335
2        6     432
3        7      45
4        9      32
5        0      54

In [12]:
df

   numbers  values
0        2     324
1        5    2335
2        6     432
3        7      45
4        9      32
5        0      54

In [16]:
df.drop(["values"], axis=1)

   numbers
0        2
1        5
2        6
3        7
4        9
5        0

In [17]:
type(df.drop(["values"], axis=1))

pandas.core.frame.DataFrame

In [18]:
df.drop([0], inplace=True)

In [19]:
df

   numbers  values
1        5    2335
2        6     432
3        7      45
4        9      32
5        0      54

In [22]:
df.reset_index(drop = True, inplace = True)

In [23]:
df

   numbers  values
0        5    2335
1        6     432
2        7      45
3        9      32
4        0      54

In [25]:
df.max(axis = 1)

TypeError: DataFrame.max() got multiple values for argument 'axis'